{
  "characters": {
    "Gojo": {
      "type": "Offensive",
      "hp": 120,
      "attack": {
        "name": "Red",
        "description": "Amplifies the repelling force of Limitless using reversed cursed energy, creating a powerful shockwave that violently repels anything in its path.",
        "damage": 28
      },
      "defense": {
        "name": "Limitless",
        "description": "Recursively divides the space between the attack and defender into a convergent series of fractional distances.",
        "base": 8,
        "boost": 15
      },
      "special": {
        "name": "Unlimited Void",
        "description": "Traps opponents in an empty space with an overwhelming amount of information. Deals 25 damage to each player and has a 50% chance to stun each opponent.",
        "cooldown": 5,
        "effects": [
          "25 damage to all",
          "50% stun chance"
        ]
      },
      "description": "The strongest jujutsu sorcerer with the Limitless technique and Six Eyes. Excels at both offense and defense with reality-warping abilities."
    },
    "Sukuna": {
      "type": "Boss",
      "hp": 140,
      "attack": {
        "name": "Dismantle",
        "description": "Slashes opponents with cursed energy capable of cutting through anything with precision.",
        "damage": 35
      },
      "defense": {
        "name": "Falling Blossom Emotion",
        "description": "An application of cursed energy that automatically repels anything it touches.",
        "base": 7,
        "boost": 10
      },
      "special": {
        "name": "Malevolent Shrine",
        "description": "Creates an open barrier where dismantle and cleave continually cut everything within a massive radius. Deals 30 damage to each player negating defense.",
        "cooldown": 6,
        "effects": [
          "30 damage to all",
          "Ignores defense"
        ]
      },
      "description": "The King of Curses with immense cursed energy and mastery of slashing techniques. His domain expansion is nearly unavoidable."
    },
    "Megumi": {
      "type": "Tactical",
      "hp": 110,
      "attack": {
        "name": "Divine Dogs",
        "description": "Summons shikigami that act as swift and relentless hunting beasts that track and attack his enemies.",
        "damage": 25
      },
      "defense": {
        "name": "Rabbit Escape",
        "description": "Creates a shield for escape by surrounding himself with thousands of rabbit shikigami.",
        "base": 9,
        "boost": 14
      },
      "special": {
        "name": "Mahoraga",
        "description": "Summons the shadow Mahoraga who is able to adapt to techniques and deal massive damage. Deals 25 damage to each player negating defense and heals 20hp.",
        "cooldown": 5,
        "effects": [
          "25 damage to all",
          "Ignores defense",
          "Heals 20 HP"
        ]
      },
      "description": "A strategic fighter who uses Ten Shadows Technique to summon powerful shikigami. His domain expansion creates a shadowy ritual space."
    },
    "Nanami": {
      "type": "Balanced",
      "hp": 120,
      "attack": {
        "name": "Ratio",
        "description": "Divides anything he touches into a 7:3 ratio, marking the weaker portion as a critical weak point for a guaranteed enhanced strike.",
        "damage": 28
      },
      "defense": {
        "name": "Block",
        "description": "Basically hardening of cursed energy to negate damage.",
        "base": 10,
        "boost": 12
      },
      "special": {
        "name": "Overtime",
        "description": "A self-imposed restriction that temporarily increases power and speed. Has a 25% chance to stun each opponent or will deal 20 damage.",
        "cooldown": 3,
        "effects": [
          "25% stun chance",
          "or 20 damage"
        ]
      },
      "description": "A precise and methodical fighter who uses ratio techniques to exploit weaknesses. His overtime mode significantly boosts his capabilities."
    },
    "Nobara": {
      "type": "Ranged",
      "hp": 130,
      "attack": {
        "name": "Hairpin",
        "description": "Plants multiple nails into a surface and detonates them simultaneously, causing large-scale destruction.",
        "damage": 27
      },
      "defense": {
        "name": "Straw Doll",
        "description": "Transmits damage into a straw doll to avoid taking a direct hit.",
        "base": 14,
        "boost": 14
      },
      "special": {
        "name": "Resonance",
        "description": "Drives a nail into a straw doll linked to her opponents, transmitting poison damage to them. Randomly poisons alive players for 1-3 moves.",
        "cooldown": 4,
        "effects": [
          "Poison damage",
          "1-3 turn duration"
        ]
      },
      "description": "A ranged combat specialist who uses nails and straw dolls to attack from distance. Her resonance technique can bypass defenses."
    }
  }
}