{
    "how can i see my recent purchases": "You can view your purchase history in your account dashboard under 'Order History'.",
    "do you offer warranty extensions": "Yes, we offer extended warranties on select products. You can add them during checkout.",
    "what's your delivery area": "We deliver to all 50 US states and most international locations. Shipping rates vary by destination.",
    "are there any special discounts today": "Check our 'Deals' section on the homepage for the latest promotions and special offers.",
    "how do i activate my product": "Activation instructions are included in the product packaging. You can also find guides on our Support page.",
    "do you sell gift certificates": "Yes, digital gift certificates are available for purchase in denominations from $25 to $500.",
    "what's the status of my exchange": "Please provide your exchange reference number so I can check on that for you.",
    "when will you restock popular items": "Most popular items are restocked weekly. You can sign up for notifications on specific products.",
    "what accessories go with my purchase": "Please specify the product model to see compatible accessories and recommendations.",
    "do you have physical stores": "We currently have flagship stores in New York, Los Angeles, Chicago, and Miami. Store hours vary by location.",
    "help with setting up my device": "We offer step-by-step setup guides on our website. Would you like a link to the specific product guide?",
    "what are your shipping options": "We offer standard (5-7 days), express (2-3 days), and next-day shipping options at checkout.",
    "can i add items to my existing order": "Once an order is placed, it cannot be modified. Please place a separate order for additional items.",
    "is there an upcoming sale": "Our next seasonal sale begins on the first of next month. Sign up for our newsletter for early access.",
    "how do i redeem my loyalty points": "Log into your account, navigate to 'My Rewards' and select 'Redeem Points' to see available options.",
    "do you price match competitors": "Yes, we offer price matching within 14 days of purchase. Please contact support with the competitor's offer.",
    "what's your repair policy": "We offer repair services for products under warranty at no charge. Out-of-warranty repairs have variable fees.",
    "where's the nearest pickup location": "Please enter your ZIP code to find the nearest pickup location.",
    "can you explain my billing charge": "To review your billing details, please provide your order ID or the last 4 digits of your payment card.",
    "do you offer student discounts": "Yes, we offer a 10% student discount. Verify your student status through our education portal.",
    "what types of warranties do you offer": "We offer standard 1-year warranties on all products and optional extended warranties up to 3 years.",
    "how do i use my promo code": "Enter your promo code in the designated field during checkout before finalizing your payment.",
    "when are you having another flash sale": "Flash sales are announced through our newsletter and social media channels with minimal advance notice.",
    "do you offer technical support": "Yes, technical support is available by phone, email, or live chat during business hours.",
    "can i change my shipping method": "Shipping methods can only be changed within 1 hour of placing your order. Please contact support immediately.",
    "what's included in the package": "Please specify which product you're inquiring about to get detailed package contents.",
    "are there bulk purchase discounts": "Yes, we offer tiered discounts starting at purchases of 5+ units. Please contact our sales team.",
    "how do i check if my product is authentic": "All our products have verification codes. Please enter the code from your product on our verification page.",
    "what chargers work with my device": "Please specify your device model so I can recommend compatible charging options.",
    "can i schedule a delivery time": "Premium delivery allows for scheduled delivery windows. This option is available at checkout for an additional fee.",
    "how do i submit product feedback": "You can submit product feedback through your account under 'My Purchases' or via our feedback form.",
    "is there a restocking fee for returns": "No restocking fee applies for returns within 30 days. A 15% fee may apply after 30 days.",
    "do you have assembly services": "We offer professional assembly services for select products at an additional cost.",
    "what's your pre-order policy": "Pre-orders require a 20% deposit and are fulfilled in the order they're received when stock arrives.",
    "can i get an invoice for my business": "Yes, business invoices can be requested by providing your business details and order information.",
    "do you have a rewards program": "Yes, our loyalty program offers 1 point per dollar spent, redeemable for discounts on future purchases.",
    "when do seasonal products arrive": "Seasonal products typically become available 4-6 weeks before the relevant season or holiday.",
    "what financing options do you offer": "We offer 0% financing for 12 months on purchases over $500 through our partner credit services.",
    "how do i become a seller on your platform": "Interested sellers can apply through our 'Become a Partner' page with business credentials.",
    "can i get a product demonstration": "Virtual product demonstrations are available by appointment. In-store demos are available during business hours."
}
